<template>
  <view v-if="isShow" class="popup">
    <view class="dialog">
      <view class="title">用户服务协议</view>
      <view class="text"
        >为使用MeowChat微信小程序服务（以下简称“本服务”或“小程序服务”），您应当仔细阅读并遵守《MeowChat微信小程序用户协议》，您可以自由选择是否使用本程序，您对本服务的登录、查看、发布信息等行为即视为已阅读并同意本条款的约束。
        <br />
        一、协议的范围
        <br />
        1.1本条款是用户（以下简称“您”）与MeowChat之间关于用户使用小程序服务所订立的协议。“用户”是指注册、登录、使用微信小程序的个人或组织；“其他用户”是指包括其他微信小程序用户、微信公众账号用户和微信用户等除您本人外与小程序服务相关的用户。
        <br />
        1.2本服务是指MeowChat根据本协议向您提供的服务。我们会不断丰富您使用本服务的终端、形式等，如您已注册使用一种形式的服务，则可以以同一账号使用其他服务，本协议自动适用于您对所有版本的软件和服务的使用。
        <br />
        1.3提供本服务的微信小程序的所有权和全部的使用权均归MeowChat所有，您开通后仅授权使用部分功能，具体以产品展示的为准。
        <br />
        1.4小程序属于微信公众账号，在不与本协议冲突的情况下，您应遵守《微信公众平台服务协议》、《腾讯微信软件许可及服务协议》等关于微信公众账号的其他相关规定。
        <br />
        1.5本协议内容包括本协议正文及所有我们已经发布或将来可能发布的隐私权政策、各项政策、规则、声明、通知、警示、提示、说明（以下统称为“用户规则”）。前述用户规则为本协议不可分割的补充部分，与本协议具有同等法律效力。如您使用MeowChat产品及服务，视为您同意上述补充部分。
        <br />
        二、小程序注册与审核
        <br />
        2.1账号注册
        <br />
        2.1.1您在使用本服务前需要先进行注册和认证。您确认，在您开始注册使用MeowChat产品及服务前，您应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若您不具备前述主体资格，请勿使用服务，否则您及您的监护人应承担因此而导致的一切后果，且我们有权注销（永久冻结）您的账户，并向您及您的监护人索偿。
        <br />
        2.1.2当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得MeowChat平台账户并成为产品用户，即有权使用MeowChat平台并获得相应服务。MeowChat平台只允许每位用户使用一个主账户，但您可以在授权范围内获得多个子账号。
        <br />
        2.1.3该账户是您通过MeowChat平台寻求并获得服务的唯一有效身份证明，请您妥善保管账号和密码。为使您更好地使用MeowChat平台的各项服务，保障您的账户安全，本小程序主体可要求您按本协议、用户规则及我国法律规定完成实名认证。
        <br />
        2.1.4为维护小程序的健康运营，您应当准确完整地提供您的最新信息（包括您的名称及电子邮件地址、联系电话、联系地址等）。并且您承诺，在使用本服务的过程中提交和发布的信息均是真实、合法的，因不实信息导致MeowChat或者第三方合法权益受损的，由您独立承担全部责任。
        <br />
        2.2账号安全
        <br />
        2.2.1在您成功注册后，我们将根据您的身份要素识别您的身份和授权登录。“身份要素”包括但不限于您的账户名称、密码、短信校验码、手机号码、身份证件号码及人脸信息、眼纹信息。您同意基于不同的终端以及您的使用习惯，我们可能采取不同的验证措施识别您的身份。
        <br />
        2.2.2如您发现账号遭他人非法使用，应立即通知本小程序主体。因黑客行为或您自身保管疏忽导致账号、密码遭他人非法使用所发生的一切责任，均应由您本人承担，本小程序主体不承担任何责任。
        <br />
        2.2.3您注册成功后，MeowChat将给予您一个帐号，并由您自行设置相应密码，任何该账户项下的预订及支付等行为均视为您本人的操作。您应对您账户项下的所有行为结果（包括但不限于授权、绑定、结算）负责。
        <br />
        三、服务及规范
        <br />
        3.1服务内容
        <br />
        3.1.1本服务内容包含【猫咪图鉴、喵友圈、发布动态、快速联系】等技术功能，这些功能服务可能根据用户需求的变化，随着因服务版本不同、或服务提供方的单方判断而被优化或修改，或因定期、不定期的维护而暂缓提供。
        <br />
        3.1.2MeowChat有权自行决定对服务或服务任何部分及其相关功能、应用软件进行变更、升级、修改、转移，并有权决定以适当的方式进行公示或通知。
        <br />
        3.2服务费用
        <br />
        3.2.1MeowChat平台向您提供的服务目前是免费的。我们保留日后就程序及/或服务向您收费的权利。如果我们决定收取此类费用，我们会采取合理途径并以足够合理的期限提前通过法定程序并以本协议约定的方式通知您，确保您有充分选择的权利。
        <br />
        3.3服务使用规则
        <br />
        3.3.1您在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表MeowChat的观点、立场或政策，MeowChat对此不承担任何责任。
        <br />
        3.3.2您不得利用MeowChat账号或本服务进行如下行为：(1)提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；(2)强制、诱导其他您关注、点击链接页面或分享信息的；(3)虚构事实、隐瞒真相以误导、欺骗他人的；(4)利用技术手段批量建立虚假账号的；(5)利用平台账号或本服务从事任何违法犯罪活动的；(6)制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；(7)其他违反法律法规规定、侵犯其他您合法权益、干扰MeowChat正常运营或MeowChat未明示授权的行为。
        <br />
        3.3.3MeowChat有权查阅您的注册、动态信息，如发现可能存在违反法律法规、本协议或相关规则的情形或其他任何问题，MeowChat有权直接做出其认为合理的处理，包括但不限于通知修改、删除相关信息，停止被协议项下的服务内容等。前述约定不代表MeowChat应对您的行为承担任何连带责任，您应对此产生的法律责任独立负责。
        <br />
        四、法律责任
        <br />
        4.1用户责任
        <br />
        4.1.1您应遵守《微信公众平台服务协议》中关于“法律责任”的约定，除非该等约定与本协议存在冲突。
        <br />
        4.1.2如果我们发现或收到他人举报或投诉您违反本协议约定的，我们有权不经通知随时对相关内容，包括但不限于对您的资料、聊天记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁的处罚，且通知您处理结果。
        <br />
        4.1.3您理解并同意，因您违反相关法律法规或本协议约定引发的任何后果，均由您独立承担责任、赔偿损失，与我们无关。如侵害到MeowChat或他人权益的，您须自行承担全部责任和赔偿一切损失。
        <br />
        4.2平台责任本小程序主体保证并承诺，本小程序主体系合法成立的法人，依据本协议约定向您提供相关网络服务，并会参考您提出的建议不断改善我们的服务，努力提高您的使用满意度。
        <br />
        4.3知识产权声明
        <br />
        4.3.1MeowChat在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归MeowChat所有，您在使用本服务中所产生的内容的知识产权归您或相关权利人所有。
        <br />
        4.3.2除另有特别声明外，MeowChat提供本服务时所依托软件的著作权、专利权、代码技术及其他知识产权均归MeowChat所有。
        <br />
        五、隐私政策
        <br />
        5.1保护用户隐私是的MeowChat一项基本政策，MeowChat保证不对外公开或向第三方提供您的注册资料及您在使用网络服务时存储在MeowChat的非公开内容，但下列情况除外：（1）事先获得用户的明确授权；（2）根据有关的法律法规要求；（2）按照相关政府主管部门的要求；（3）为维护社会公众的利益；（4）为维护MeowChat的合法权益。
        <br />
        5.2当MeowChat与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方允诺严格承担与MeowChat同等的保护用户隐私的责任，则视为您授权MeowChat将包含个人注册资料在内的相关信息仅提供给该等第三方。
        <br />
        六、协议解除和终止
        <br />
        6.1如有下列情形的，我们有权单方面解除本协议，终止向您提供服务：（1）您为了非法目的而使用本服务的；（2）您使用本服务损害MeowChat或其他第三方合法权益的；（3）您违反法律法规或本协议约定或违反与腾讯的其他约定的；（4）根据法律规定平台用户应提交真实信息，而您提供的资料不真实、或未能提供合理证明以证明其真实性的；
        <br />
        6.2您同意，除上述所述情形外，MeowChat有权根据风险及自身业务运营情况需要，随时终止向您提供本服务及接口的部分及全部，因此导致您无法使用服务或服务受到限制的，MeowChat不构成违约，亦不承担任何法律责任。
        <br />
        6.3您停用该服务，或MeowChat终止向您提供本协议项下的服务后，MeowChat不再为您保留原账户中与之相关的任何信息。
        <br />
        6.4您使用本服务即视为您已阅读并同意受本协议的约束。MeowChat小程序主体有权在必要时修改本协议。您可以在相关服务页面查阅最新版本的协议。本协议变更后，如果您继续使用微信小程序服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用小程序服务。
        <br />
        七、法律管辖
        <br />
        7.1如双方就本协议内容或其执行发生任何争议，双方应友好协商解决；协商不成时，任何一方均可向MeowChat所在地的人民法院提起诉讼。
        <br />
        7.2本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）
        <br />
        7.3本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方都具有约束力。
        <br />
      </view>
      <view class="confirm" :value="type" @click="closeText">
        我已确认用户服务协议
      </view>
      <view class="cancel" @click="goBack"> 我再想想 </view>
    </view>
  </view>
</template>

<script lang="ts" setup>
import { ref } from "vue";
import { Pages } from "@/utils/url";

const isShow = ref(true);
function closeText() {
  isShow.value = !isShow.value;
  uni.setStorageSync("isShow", false);
}
function goBack() {
  uni.reLaunch({
    url: Pages.Community
  });
}
</script>

<style lang="scss" scoped>
.popup {
  position: fixed;
  z-index: 200;
  left: 0;
  right: 0;
  top: 0;
  bottom: 0;
  background: rgba(190, 190, 190, 0.8);

  .dialog {
    position: relative;
    display: grid;
    margin-top: 170rpx;
    margin-left: 32rpx;
    width: 92%;
    height: 85%;
    border-radius: 50rpx;
    opacity: initial;
    background-color: #fafcff;

    .title {
      position: relative;
      text-align: center;
      font-weight: bold;
      letter-spacing: 3rpx;
      margin-top: 25rpx;
      margin-bottom: 25rpx;
      font-size: 38rpx;
    }

    .text {
      overflow: scroll;
      text-indent: 1em;
      font-size: 20rpx;
      margin-left: 30rpx;
      margin-right: 30rpx;
      padding: 10rpx 20rpx 10rpx 20rpx;
      height: 90%;
      color: #696969;
      background-color: #f2f2f2;
    }

    .confirm {
      position: relative;
      text-align: center;
      font-size: 30rpx;
      margin: -70rpx 100rpx 15rpx;
      padding: 10rpx 50rpx 10rpx 50rpx;
      border-radius: 25rpx;
      letter-spacing: 2rpx;
      color: #ffffff;
      background-color: #1fa1ff;
    }

    .cancel {
      position: relative;
      text-align: center;
      font-size: 30rpx;
      margin-bottom: 30rpx;
      margin-left: 100rpx;
      margin-right: 100rpx;
      padding: 10rpx 50rpx 10rpx 50rpx;
      border-radius: 25rpx;
      letter-spacing: 2rpx;
      color: #bdbdbd;
      background-color: #eeeeee;
    }
  }
}
</style>
